KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ГрупповоеСозданиеСпецификации/КАНАТ_ГрупповоеСозданиеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ГрупповоеСозданиеСпецификации</name>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ссылки</name>
    <attributes>
      <name>ссылки</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc79d025-e4b3-4adf-ad53-eda1f76f3bfa">
    <name>ОсновноеИзделиеНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50617dd7-6ff4-4dc2-a0d1-1996bd1af55b">
    <name>ОсновноеИзделиеХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТехнологическаяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДокладнаяЗаписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Основание</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dea18009-f98d-468a-859b-cf3cce9196a0">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f541bc89-351d-4def-99c7-bc02b9497244">
    <name>ВариантНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef8d7a41-0646-43ad-88f6-4a05fdfd4001">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7c508eb-b4e9-4a54-9256-56fe64f44bf1">
    <name>НачалоДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fccdf260-9852-4290-a022-4a8aa7f7f0f4">
    <name>ВыпускПроизвольнымиПорциями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="052b8eae-f60e-4c3c-abd6-a4695a5e825e">
    <name>МинимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b7f922c-a145-4699-8371-53c4af687ca8">
    <name>МногоэтапныйПроизводственныйПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3abe02c-7357-44f4-8c29-1103001fc9a0">
    <name>ЕстьНекратныеНормативыВРЦ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="274549a5-518a-4913-a049-05b30732d5ba">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bbc3dbe-eeea-4b75-9545-caf94f8f036f">
    <name>РазрешитьВыборДляИзделийПобочногоВыхода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c367fe-c52b-4c0f-a74f-6845403cc761">
    <name>ОптимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="add9bf8f-b6e4-499c-97f2-421c3d17eb91">
    <name>ОграниченСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="406ad767-ca83-4ad0-b1f8-9ac8daee6f79">
    <name>МаксимальныйСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="606417f4-2092-4500-a40a-6e49ae00544d">
    <name>ОптимальноеКоличествоПередачиМеждуЭтапами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7f6ae2-e8b9-4fce-8fa3-629ee39f2ca5">
    <name>ПечатьМаршрутнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f664e98-6ce5-44b6-b35a-8e83c01a9b69">
    <name>ОсновноеИзделиеВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c90f934b-9c20-478f-85ee-7274cd9979b8">
    <name>ОписаниеУточненияПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2e8a86-949a-4e4f-812b-94f43e3fd12e">
    <name>ОсновноеИзделиеУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3124293-0b8d-4882-b23c-439b2566fc63">
    <name>ОсновноеИзделиеЭтап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8cfece92-bb5d-4623-871a-42563d78d9c0">
    <name>ЕстьВложенныеСпецификации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c232012-137e-4fe3-a365-c69eecfc553a">
    <name>ДопустимоеПревышениеОптимальнойПартииВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d9e9276-13e9-4b17-a242-69b99618df3c">
    <name>ВариантПодбораВДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0634919c-9496-4ed5-8d44-222275fdf51d">
    <name>ЕстьУточняемоеОсновноеИзделие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71f3c8a4-5f20-400f-aef5-acbf7a734855">
    <name>ЕстьПараметризацияРесурсов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02138102-fb2c-4d61-a0ee-ad75034be9fa">
    <name>ЕстьРасчетВероятности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c225c8c7-cc0e-4917-91b9-de521887536d">
    <name>ОтветственноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0ad745f-112b-4b3c-8d90-d1200757685d">
    <name>ИдентификаторВерсииДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d938bbe4-fc79-49eb-ba11-f6f1d62d7ab4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a6c2c71-230f-425a-a0e6-d556c2f47f3a">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dee0ba41-dd89-4212-ace9-8a7a209bce5b">
      <name>АлгоритмАвтовыбораХарактеристики</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1e20410-a0e0-4aba-8122-7aef753d2cd5">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="71a20cef-31cc-4da2-82e6-195ae04b99d6">
      <name>ТребуетсяУказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9766914-b51b-49c3-854b-6185efea75fc">
      <name>ОписаниеИзделия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e00a89f7-24ad-4d28-8e86-331ef04bb0d7">
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="76aa45fe-dde7-48b0-940f-7eaf21bba0cc">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ГрупповоеСозданиеСпецификации/Forms/Форма/Module.bsl
//++Бит Трейгер П.М. 23.10.2024
&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
    ПараметрыФормы = Новый Структура(
        "ЗакрыватьПриВыборе,МножественныйВыбор",
        Ложь,
        Истина
    );
    ОткрытьФорму(
        "Справочник.Номенклатура.ФормаВыбора",
        ПараметрыФормы,
        Элементы.Номенклатура
    );
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
массив = новый Массив;
Для каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
новааястрока = Объект.Номенклатура.Добавить();
новааястрока.номенклатура = ВыбранныйЭлемент;
КонецЦикла;	
КонецПроцедуры


&НаСервере
процедура убратьДубли()
	
Если Объект.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка() или Объект.Номенклатура.Количество() = 0 Тогда
		Сообщить("Сначала выберите спецификацию и номенклатуру");
Иначе	
таб = Новый ТаблицаЗначений;
таб = Объект.Номенклатура.Выгрузить();
таб.Свернуть("номенклатура");
Объект.Номенклатура.Очистить();
Объект.Номенклатура.Загрузить(таб);



//Для каждого стр из таб  Цикл
//   новаяспеца = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
//   новаяспеца.Заполнить(спец);
//   //новаяспеца.ОсновноеИзделиеНоменклатура = стр.номенклатура;
//   новаяспеца.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
//   новаяспеца.Записать();
//   
//   
//   //форма = новаяспеца.Ссылка.ПолучитьФорму("ФормаЭлемента");
//   //форма.ЭлементыФормы.ОсновноеИзделиеНоменклатура = стр.номенклатура;
//   //форма.заполнитьНовуюНоменклатуру();	
//КонецЦикла;
//КонецЕсли;
 КонецЕсли;

конецПроцедуры
&НаКлиенте
Процедура СоздатьСпецификации(Команда)
убратьДубли();
заполнитьСпецификации();

КонецПроцедуры
&НаСервере
процедура заполнитьспецификации()
	
	спец = Объект.Спецификация;
	Для каждого стр из  Объект.Номенклатура Цикл
		если стр.номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			
		Иначе	
			Ссылка = УправлениеДаннымиОбИзделияхВызовСервера.КопироватьРесурснуюСпецификацию(спец);
			объектспец = Ссылка.ПолучитьОбъект();
			объектспец.Наименование = стр.номенклатура;
			объектспец.ОсновноеИзделиеНоменклатура = стр.номенклатура; 
			объектспец.ВыходныеИзделия[0].Номенклатура =стр.номенклатура;
			объектспец.Записать();	
		КонецЕсли; 
	КонецЦикла;	
конецпроцедуры
//--Бит Трейгер П.М. 23.10.2024
